Revit 2018 API
Rebar.GetBarPositionTransform Method
 Return a transform representing the relative position of any individual bar in the set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().GetBarPositionTransform() instead.")]
public Transform GetBarPositionTransform(
	int barPositionIndex
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().GetBarPositionTransform() instead.")> _
Public Function GetBarPositionTransform ( _
	barPositionIndex As Integer _
) As Transform
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().GetBarPositionTransform() instead.")]
public:
Transform^ GetBarPositionTransform(
	int barPositionIndex
)
Parameters
barPositionIndex
Type: System.Int32
 An index between 0 and (NumberOfBarPositions-1).
Return Value
 The position of a bar in the set relative to the first position.
Remarks
 The transform is a translation along the distribution path. It can be applied to the results of GetCenterlineCurves() to produce any bar in the rebar set. For barPositionIndex=0, the identity transform is always returned.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Autodesk.Revit.Exceptions.InvalidOperationException |  This method applies only to shape driven rebar.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace